module ApplicationHelper
  def all_categories
    [
      {:id=>"1", :title=>"Бизнес и стартапы"}, 
      {:id=>"2", :title=>"Маркетинг и PR"}, 
      {:id=>"3", :title=>"Женский раздел"}, 
      {:id=>"4", :title=>"Авторские блоги"}, 
      {:id=>"5", :title=>"Мотивация и саморазвитие"}, 
      {:id=>"6", :title=>"Образование"}, 
      {:id=>"7", :title=>"Отдых и развлечения"}, 
      {:id=>"8", :title=>"18+"}, 
      {:id=>"9", :title=>"Криптовалюты"}, 
      {:id=>"10", :title=>"Юмор и мемы"}, 
      {:id=>"11", :title=>"Интернет технологии"}, 
      {:id=>"12", :title=>"Трейдинг"}, 
      {:id=>"13", :title=>"Политика"}, 
      {:id=>"14", :title=>"Здоровье и медицина"}, 
      {:id=>"15", :title=>"Инвестиции"}, 
      {:id=>"16", :title=>"Авто и мото"}, 
      {:id=>"17", :title=>"Каталоги каналов и ботов"}, 
      {:id=>"18", :title=>"Спорт"}, 
      {:id=>"19", :title=>"Религия и духовность"}, 
      {:id=>"20", :title=>"Еда и кулинария"}, 
      {:id=>"21", :title=>"Путешествия и туризм"}, 
      {:id=>"22", :title=>"Новости и СМИ"}, 
      {:id=>"23", :title=>"Кино"}, 
      {:id=>"24", :title=>"Иностранные языки"}, 
      {:id=>"25", :title=>"Наука и технологии"}, 
      {:id=>"26", :title=>"Видеоигры"}, 
      {:id=>"27", :title=>"Музыка"}, 
      {:id=>"28", :title=>"Искусство и дизайн"}, 
      {:id=>"29", :title=>"Узбекские каналы"}, 
      {:id=>"30", :title=>"В мире животных"}, 
      {:id=>"31", :title=>"Юриспруденция"}, 
      {:id=>"32", :title=>"Недвижимость"}, 
      {:id=>"33", :title=>"Другое"}, 
      {:id=>"34", :title=>"Красота и уход"}, 
      {:id=>"35", :title=>"Строительство и ремонт"}, 
      {:id=>"36", :title=>"Мода и стиль"}, 
      {:id=>"37", :title=>"Региональные"}, 
      {:id=>"38", :title=>"Дети и родители"}, 
      {:id=>"39", :title=>"Скидки и акции"}, 
      {:id=>"40", :title=>"Сливы Заработок"}, 
      {:id=>"41", :title=>"Книги, Аудиокниги и Подкасты"}, 
      {:id=>"42", :title=>"Ставки и азартные игры"}, 
      {:id=>"43", :title=>"Знаменитости и образ жизни"}, 
      {:id=>"44", :title=>"Культура и события"}, 
      {:id=>"45", :title=>"Любопытные факты"}, 
      {:id=>"46", :title=>"Экономика и Финансы"}, 
      {:id=>"47", :title=>"Фитнес"}, 
      {:id=>"48", :title=>"История"}, 
      {:id=>"49", :title=>"Хобби и развлечения"}, 
      {:id=>"50", :title=>"Инвестиции"}, 
      {:id=>"51", :title=>"Психология и отношения"}
    ]
  end

  def find_category(id)
    find_category = all_categories.select{|category| category[:id] == id.to_s}.last
    find_category.present? ? find_category[:title] : "-"
  end
end
